#!/bin/sh
set -e

echo "Запуск верифікації розгортання..."

# Даємо контейнерам 3 секунди, щоб остаточно підняти процеси всередині
sleep 20

# Робимо запит до Nginx. Прапорець -L змушує curl йти по редіректах, якщо вони є.
STATUS=$(curl -o /dev/null -s -w "%{http_code}" -L http://localhost:80/)

echo "Отримано статус-код: $STATUS"

if [ "$STATUS" = "200" ]; then
    echo "Верифікація успішна: веб-сервер повернув статус 200 OK!"
    exit 0
else
    echo "Верифікація провалена: отримано статус $STATUS"
    exit 1
fi
